In [1]:
# List of high schools

high_schools = ["Hernandex High School", "Figueroa High School", "Wilson High School", "Wright High School"]

for school in high_schools:
    print(school)

Hernandex High School
Figueroa High School
Wilson High School
Wright High School

In [2]:
# A dictionary of high schools and the type of school

high_school_types = [{"High School": "Griffin", "Type": "District"}, {"High School": "Figueroa", "Type": "District"}, {"High School": "Wilson", "Type": "Charter"}, {"High School": "Wright", "Type": "Charter"}]

for high_school in high_school_types:
    print(high_school)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [3]:
# List of high schools

high_schools = ["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [4]:
# Add the Pandas dependency

import pandas as pd

# Create a Pandas Series from a list

school_series = pd.Series(high_schools)

In [5]:
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [6]:
for school in school_series:
    print(school)

Huang High School
Figueroa High School
Shelton High School
Hernandez High School
Griffin High School
Wilson High School
Cabrera High School
Bailey High School
Holden High School
Pena High School
Wright High School
Rodriguez High School
Johnson High School
Ford High School
Thomas High School

In [7]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [8]:
# Convert dictionary of high schools to a DataFrame

schools_df = pd.DataFrame(high_school_dicts)

schools_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [9]:
# Three separate lists of information on high schools
school_id = [0,1,2,3,4]

school_name = ["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School", "Griffin High School"]

type_of_school = ["Disctrict", "District", "Charter", "District", "Charter"]

In [10]:
# Initialize a new Dataframe
school_df = pd.DataFrame()

In [11]:
# Add the list to a new DataFrame
school_df["School ID"] = school_id

# Print the DataFrame
school_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [12]:
# Add remaining lists to DataFrame
school_df["Name"] = school_name
school_df["Type"] = type_of_school

school_df

   School ID                   Name       Type
0          0      Huang High School  Disctrict
1          1   Figueroa High School   District
2          2    Shelton High School    Charter
3          3  Hernandez High School   District
4          4    Griffin High School    Charter

In [13]:
schools_df.columns

Index(['School ID', 'Name', 'Type'], dtype='object')

In [14]:
schools_df.index

RangeIndex(start=0, stop=5, step=1)

In [15]:
school_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [21]:
school_ids = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14]
school_names = ["Huang","Figueroa","Shelton","Hernandex","Griffin","Wilson","Cabrera","Bailey","Holden","Pena","Wright","Rodriguez","Johnson","Ford","Thomas"]
types = ["District","District","Charter","District","Charter","Charter","Charter","District","Charter","Charter","Charter","District","District","District","Charter"]

school_dfs = pd.DataFrame()

school_dfs["School ID"] = school_ids
school_dfs["Name"] = school_names
school_dfs["Type"] = types

school_dfs

    School ID       Name      Type
0           0      Huang  District
1           1   Figueroa  District
2           2    Shelton   Charter
3           3  Hernandex  District
4           4    Griffin   Charter
5           5     Wilson   Charter
6           6    Cabrera   Charter
7           7     Bailey  District
8           8     Holden   Charter
9           9       Pena   Charter
10         10     Wright   Charter
11         11  Rodriguez  District
12         12    Johnson  District
13         13       Ford  District
14         14     Thomas   Charter

In [4]:
import pandas as pd

prices = pd.DataFrame({
    "price_usd": ["$0.53", "$0.22", "0.34"]
})

prices

  price_usd
0     $0.53
1     $0.22
2      0.34

In [5]:
prices.dtypes

price_usd    object
dtype: object

In [8]:
prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].str.replace("$", "")

prices

C:\Users\delil\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  """Entry point for launching an IPython kernel.

  price_usd
0      0.53
1      0.22
2      0.34

In [9]:
prices.dtypes

price_usd    object
dtype: object

In [10]:
prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].astype("float")
prices.dtypes

price_usd    float64
dtype: object